[
  {
    "id": 28,
    "title": "The $100 Billion Breakthrough: How AI is Finally Solving the Biggest Bottleneck in Drug Manufacturing",
    "slug": "the-100-billion-breakthrough-how-ai-is-finally-solving-the-biggest-bottleneck-in-drug-manufacturing",
    "date": "December 14, 2025",
    "category": "Pharma",
    "name": "Yi Qu",
    "summary": "A quiet revolution is underway, driven by the surging demand for some of the most important new medicines today—specifically, peptides. These critical building blocks are the core components of modern therapeutics, including the rapidly growing GLP-1 treatments used for diabetes and weight loss. The numbers are staggering: the global peptide market is projected to more than double by 2030, potentially reaching over $100 billion. Yet, this massive growth faces an immediate, tangible threat: supply chain constraints and chemical processes that are difficult to scale up. This urgent need for innovation is why WR Grace & Co, a global leader in specialty chemicals, has struck a strategic, multi-year pact with Molecule.one, a pioneer in chemical AI. Their mission: to reinvent how these crucial chemical compounds are manufactured at scale and break the manufacturing bottlenecks slowing down innovation. MARIA: The Engine Driving Novel Chemistry The key to this collaboration is the deployment of Molecule.one’s MARIA AI and high-throughput experimentation platform. This platform is more than just a software tool; it combines computational intelligence with thousands of autonomously executed, miniaturized reactions. By doing this, MARIA rapidly identifies and prioritizes production routes that are far more efficient than conventional methods. The partnership is starting by advancing the synthesis of select peptide components, aiming to use this combined approach to deliver scalable solutions that outperform older peptide synthesis methods. As Brenda Kelly, President of Materials Technologies at Grace, noted, combining Grace’s deep expertise in fine chemicals with Molecule.one’s platform is intended to transform how they scale and manufacture pharmaceuticals, while also strengthening their capabilities at their US Fine Chemicals Manufacturing sites.",
    "readingTime": "3 min read",
    "contentUrl": "/posts/the-100-billion-breakthrough-how-ai-is-finally-solving-the-biggest-bottleneck-in-drug-manufacturing.html"
  },
  {
    "id": 16,
    "title": "AI Digest — AI-Ready Chemistry Secures Drug Supply, Plus ChatGPT's Shopping Edge",
    "slug": "ai-digest-ai-ready-chemistry-secures-drug-supply-plus-chatgpts-shopping-edge",
    "date": "December 06, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "The digest covers how AI-ready chemistry is securing the drug supply chain and the launch of ChatGPT's new personalized shopping feature. It also touches on Meta's content licensing deals and a positive outlook on AI's impact on job creation.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/ai-digest-ai-ready-chemistry-secures-drug-supply-plus-chatgpts-shopping-edge.html"
  },
  {
    "id": 15,
    "title": "What I Learned About the Future of Work from Microsoft's Internal HR Transformation",
    "slug": "what-i-learned-about-the-future-of-work-from-microsofts-internal-hr-transformation",
    "date": "December 3, 2025",
    "category": "Global AI Trends",
    "excerpt": "Today I attended a webinar regarding Microsoft’s Internal HR Transformation, featuring leaders from Microsoft. Here’s What I Learned About the Future of Work.",
    "contentUrl": "/posts/what-i-learned-about-the-future-of-work-from-microsofts-internal-hr-transformation.html",
    "name": "Yi Qu",
    "readingTime": "3 min"
  },
  {
    "id": 14,
    "title": "How I Decide When to Split a Document for AI (and My Simple Rules)",
    "slug": "how-i-decide-when-to-split-a-document-for-ai-and-my-simple-rules",
    "date": "December 2, 2025",
    "category": "Tools & Tips",
    "excerpt": "When I first used AI to search my notes, I dropped giant files into the system and hoped for magic. Instead, I got slow searches, vague answers, and sometimes the AI skipped the one section I needed. So I changed my approach. Now, before I upload anything, I pause and ask: Should I split this into smaller pieces, or keep it as one file?",
    "contentUrl": "/posts/how-i-decide-when-to-split-a-document-for-ai-and-my-simple-rules.html",
    "name": "Yi Qu",
    "readingTime": "3 min"
  },
  {
    "id": 13,
    "title": "AI Digest — Gemini 3 and the Global AI Infrastructure Race",
    "slug": "ai-digest-gemini-3-and-the-global-ai-infrastructure-race",
    "date": "November 30, 2025",
    "category": "Global AI Trends",
    "excerpt": "Today's AI Digest covers major global developments, including Google's launch of the advanced Gemini 3 model integrated into Search, a significant European effort to build an AI data 'gigafactory,' and the growing trend of US startups utilizing free Chinese AI models.",
    "contentUrl": "/posts/ai-digest-gemini-3-and-the-global-ai-infrastructure-race.html",
    "name": "Yi Qu",
    "readingTime": "3 min"
  },
  {
    "id": 12,
    "title": "Start Orchestrating AI: Why Your Company Needs a Conductor, Not Just Bridges",
    "slug": "start-orchestrating-ai-why-your-company-needs-a-conductor-not-just-bridges",
    "date": "November 29, 2025",
    "category": "Learning Resources",
    "excerpt": "I recently read the incredibly insightful report from Zapier, Beyond integration: Why top enterprises are choosing AI orchestration, and I wanted to share what I learned from this report about why modern businesses need to stop just integrating AI and start orchestrating it.",
    "contentUrl": "/posts/start-orchestrating-ai-why-your-company-needs-a-conductor-not-just-bridges.html"
  },
  {
    "id": 11,
    "title": "Forget Chatbots: The AI Revolution Is Moving to Autonomous Agents",
    "slug": "forget-chatbots-the-ai-revolution-is-moving-to-autonomous-agents",
    "date": "November 28, 2025",
    "category": "Global AI Trends",
    "excerpt": "I just read the new introduction to agents white paper from Google, and it covers an important topic: Artificial Intelligence is undergoing a fundamental shift. For years, AI was passive, focused on discrete tasks like generating text or answering one question. It needed constant human guidance.",
    "contentUrl": "/posts/forget-chatbots-the-ai-revolution-is-moving-to-autonomous-agents.html"
  },
  {
    "id": 10,
    "title": "AI Digest — AI's Job Impact and Google's Hardware Push",
    "slug": "ai-digest-ai-s-job-impact-and-google-s-hardware-push",
    "date": "November 27, 2025",
    "category": "Global AI Trends",
    "excerpt": "A new MIT study estimates that current AI systems are technically and economically capable of performing tasks equivalent to 11.7% of the U.S. labor market, representing about $1.2 trillion in wages.",
    "contentUrl": "/posts/ai-digest-ai-s-job-impact-and-google-s-hardware-push.html"
  },
  {
    "id": 3,
    "title": "AI's Global Impact: Jobs, Chips, and Molecular Design",
    "slug": "ai-s-global-impact-jobs-chips-and-molecular-design",
    "date": "November 27, 2025",
    "category": "Global AI Trends",
    "excerpt": "AI is reshaping the world, from the job market and the geopolitical race for advanced chips to the revolutionary acceleration of molecular design and drug discovery.",
    "contentUrl": "/posts/ai-s-global-impact-jobs-chips-and-molecular-design.html",
    "name": "Yi Qu"
  },
  {
    "id": 1,
    "title": "A Lab Breakthrough: AI and Green Chemistry Streamline Drug Testing",
    "slug": "a-lab-breakthrough-ai-and-green-chemistry-streamline-drug-testing",
    "date": "November 27, 2025",
    "category": "Science Labs",
    "excerpt": "A recent study introduced a smart analytical chemistry approach that successfully determined solifenacin succinate (SOF) and mirabegron (MIR) simul...",
    "contentUrl": "/posts/a-lab-breakthrough-ai-and-green-chemistry-streamline-drug-testing.html"
  },
  {
    "id": 2,
    "title": "AI Policy and Industry Restructuring",
    "slug": "ai-policy-and-industry-restructuring",
    "date": "November 27, 2025",
    "category": "Global AI Trends",
    "excerpt": "The AI landscape is rapidly evolving with major policy initiatives and industry shifts reshaping how companies and governments approach artificial ...",
    "contentUrl": "/posts/ai-policy-and-industry-restructuring.html"
  },
  {
    "id": 4,
    "title": "AI Speeds Up Natural Crop Protection",
    "slug": "ai-speeds-up-natural-crop-protection",
    "date": "November 27, 2025",
    "category": "AgTech",
    "excerpt": "Modern agriculture needs smart, innovative solutions that protect crops while enhancing sustainability and meeting strict regulatory standards. Mic...",
    "contentUrl": "/posts/ai-speeds-up-natural-crop-protection.html"
  },
  {
    "id": 9,
    "title": "Gemini 3, Antigravity, and What It Really Means for Developers",
    "slug": "gemini-3-antigravity-and-what-it-really-means-for-developers",
    "date": "November 27, 2025",
    "category": "Tools & Tips",
    "excerpt": "Google just launched Gemini 3 and the new Antigravity IDE. Many people say this is the start of a new era. Some even call it a \"programmer killer\"....",
    "contentUrl": "/posts/gemini-3-antigravity-and-what-it-really-means-for-developers.html"
  },
  {
    "id": 7,
    "title": "Learn AI the Easy Way: AI For Everyone by Andrew Ng",
    "slug": "learn-ai-the-easy-way-ai-for-everyone-by-andrew-ng",
    "date": "November 27, 2025",
    "category": "Learning Resources",
    "excerpt": "AI is changing the way we live and work faster than most people can keep up. We see headlines about ChatGPT, generative AI, and automation every da...",
    "contentUrl": "/posts/learn-ai-the-easy-way-ai-for-everyone-by-andrew-ng.html"
  },
  {
    "id": 8,
    "title": "Shuttle Pharma’s Smartest Move Yet: Teaching Machines to Discover Drugs",
    "slug": "shuttle-pharmas-smartest-move-yet-teaching-machines-to-discover-drugs",
    "date": "November 27, 2025",
    "category": "Pharma",
    "excerpt": "Drug discovery has always been one of the toughest proving grounds for technology. Molecules are complex; they twist, bind, and often defy simple p...",
    "contentUrl": "/posts/shuttle-pharmas-smartest-move-yet-teaching-machines-to-discover-drugs.html"
  },
  {
    "id": 6,
    "title": "Don’t Get Left Behind in the AI Era",
    "slug": "dont-get-left-behind-in-the-ai-era",
    "date": "November 27, 2025",
    "category": "Tools & Tips",
    "excerpt": "If we don’t want to fall behind in the AI era, there is one simple habit we can build: get used to using open-source tools.",
    "contentUrl": "/posts/dont-get-left-behind-in-the-ai-era.html"
  },
  {
    "id": 17,
    "title": "Today's AI Digest — Frontier Models, Drug Discovery, and Data Scarcity",
    "slug": "ai-digest-frontier-models-drug-discovery-and-data-scarcity",
    "date": "December 07, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "This digest focuses on the release of frontier models like Mistral 3 and Gen-4.5, the validation of an AI-designed drug, and the critical issue of data scarcity forcing a shift to synthetic data.",
    "readingTime": "3 min read",
    "contentUrl": "/posts/ai-digest-frontier-models-drug-discovery-and-data-scarcity.html"
  },
  {
    "id": 18,
    "title": "AI Digest — AI's Regulatory Future and Automated Drug Discovery",
    "slug": "ai-digest-ai-s-regulatory-future-and-automated-drug-discovery",
    "date": "December 08, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "This digest covers major developments in AI, including a $45M funding round for ChemLex's automated drug discovery lab, President Trump's plan for a single national AI regulatory framework, the partnership between Warby Parker and Google on AI-powered smart glasses, and the expansion of Google's Gemini 3 Pro to the command-line interface.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/ai-digest-ai-s-regulatory-future-and-automated-drug-discovery.html"
  },
  {
    "id": 19,
    "title": "Why I Did It with the Mindset of “AI First” (and Why Verification Matters)",
    "slug": "why-i-did-it-with-the-mindset-of-ai-first-and-why-verification-matters",
    "date": "December 09, 2025",
    "category": "Tools & Tips",
    "name": "Yi Qu",
    "summary": "I got a request to complete a spreadsheet, but the information was scattered across many long reports. Instead of spending hours reading and copying, I approached it with the mindset of “AI first.”",
    "readingTime": "1 min read",
    "contentUrl": "/posts/why-i-did-it-with-the-mindset-of-ai-first-and-why-verification-matters.html"
  },
  {
    "id": 20,
    "title": "From Hobbyist to Enterprise: Mastering Workflow Automation with Make",
    "slug": "from-hobbyist-to-enterprise-mastering-workflow-automation-with-make",
    "date": "December 09, 2025",
    "category": "Learning Resources",
    "name": "Yi Qu",
    "summary": "In a session led by Make, the focus was on moving beyond simple task automation to implementing enterprise-grade governance, lifecycle management, and reliable AI integration for workflows. The session provided a technical deep dive into event-driven architecture using Google Apps Script and Webhooks, and outlined a critical scenario lifecycle for managing automations.",
    "readingTime": "5 min read",
    "contentUrl": "/posts/from-hobbyist-to-enterprise-mastering-workflow-automation-with-make.html"
  },
  {
    "id": 21,
    "title": "A Simple AI Tip: Use Built-In OCR Instead of Installing Your Own",
    "slug": "a-simple-ai-tip-use-built-in-ocr-instead-of-installing-your-own",
    "date": "December 10, 2025",
    "category": "Tools & Tips",
    "name": "Yi Qu",
    "summary": "Many AI assistants now include powerful Optical Character Recognition (OCR) built-in. This tip suggests using the AI's native OCR capabilities to convert images or PDFs with text into editable text, bypassing the need for separate, often complex, local OCR software like Tesseract.",
    "readingTime": "1 min read",
    "contentUrl": "/posts/a-simple-ai-tip-use-built-in-ocr-instead-of-installing-your-own.html"
  },
  {
    "id": 22,
    "title": "Turn a Paper Business Card into a Phone Contact with AI",
    "slug": "turn-a-paper-business-card-into-a-phone-contact-with-ai",
    "date": "December 10, 2025",
    "category": "Tools & Tips",
    "name": "Yi Qu",
    "summary": "A simple, three-step guide on how to use an AI chat app (like ChatGPT) to quickly convert a physical business card into a digital phone contact (vCard file), eliminating manual typing and reducing errors.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/turn-a-paper-business-card-into-a-phone-contact-with-ai.html"
  },
  {
    "id": 23,
    "title": "How I Turn Scanned PDF Tables into Excel",
    "slug": "how-i-turn-scanned-pdf-tables-into-excel",
    "date": "December 10, 2025",
    "category": "Tools & Tips",
    "name": "Yi Qu",
    "summary": "A guide on using AI to extract data from scanned PDF tables and convert it into an Excel-ready format, focusing on the efficiency and accuracy of modern AI tools over traditional OCR methods.",
    "readingTime": "3 min read",
    "contentUrl": "/posts/how-i-turn-scanned-pdf-tables-into-excel.html"
  },
  {
    "id": 24,
    "title": "5 Google Agent Playbooks You Should Read",
    "slug": "5-google-agent-playbooks-you-should-read",
    "date": "December 10, 2025",
    "category": "Learning Resources",
    "name": "Yi Qu",
    "summary": "A short guide to five free whitepapers from Google and Kaggle (over 250 pages) on building real-world AI agents, covering agent basics, tools (MCP), memory, quality, and production. It provides a quick summary of each paper's key takeaways.",
    "readingTime": "3 min read",
    "contentUrl": "/posts/5-google-agent-playbooks-you-should-read.html"
  },
  {
    "id": 25,
    "title": "Today's AI Digest — AI's Architects Take Center Stage, Plus a Scientific Leap",
    "slug": "today-s-ai-digest-ai-s-architects-take-center-stage-plus-a-scientific-leap",
    "date": "December 11, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "Today's AI Digest covers Time magazine naming 'The Architects of AI' as its 2025 Person of the Year, OpenAI's release of GPT-5.2 for scientific problem-solving, a $52M funding round for 'Physical AI Scientists' developer Medra, Thales's new AI Security Fabric, and Zoovu's MCP Server for agentic commerce.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/today-s-ai-digest-ai-s-architects-take-center-stage-plus-a-scientific-leap.html"
  },
  {
    "id": 26,
    "title": "AI Digest — AI Giants Clash, Policy Tightens, and Pharma Gets a Boost",
    "slug": "ai-digest-ai-giants-clash-policy-tightens-and-pharma-gets-a-boost",
    "date": "December 12, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "Today's AI Digest covers the intensifying competition between OpenAI and Google with new model releases, a major step in AI-driven drug discovery for Chronic Kidney Disease, a White House executive order to unify national AI policy, and OpenAI's new Apps SDK to integrate services directly into ChatGPT.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/ai-digest-ai-giants-clash-policy-tightens-and-pharma-gets-a-boost.html"
  },
  {
    "id": 27,
    "title": "AI Digest — Infrastructure Collides with Code, Plus GPT-5.2's Expert Upgrade",
    "slug": "ai-digest-infrastructure-collides-with-code-plus-gpt-5-2-s-expert-upgrade",
    "date": "December 13, 2025",
    "category": "Global AI Trends",
    "name": "Yi Qu",
    "summary": "This digest covers the release of OpenAI's GPT-5.2 with 'expert level' performance, the physical and financial limits of the AI infrastructure boom highlighted by Oracle's stock plunge, a new AI pact between Grace and Molecule.one to optimize peptide manufacturing, and the potential for AI to restart scientific progress and economic growth.",
    "readingTime": "2 min read",
    "contentUrl": "/posts/ai-digest-infrastructure-collides-with-code-plus-gpt-5-2-s-expert-upgrade.html"
  }
]